{
  "Repository": "Repository",
  "Projects": "Projekter",
  "About": "Om mig",
  "Contact": "Kontakt mig",
  "section": {
    "about": {
      "title": "Software Ingeniør",
      "description": "En snart nyudannet software ingeniør, med en Msc. I computer science fra IT-Universitetet i København. Mine fokus områder er maintainable skalerbar kode, man ikke får hovedpinde og ondt i øjene af at kigge på. For mig er der intet sjovere end at pushe et commit og se effekten på en live server."
    },
    "projects": {
      "scootersharing": {
        "title": "Scooter Sharing App",
        "description": "Id mollit consequat occaecat dolore cillum qui et est quis officia nisi sint excepteur irure. Ullamco et voluptate magna amet occaecat ad cupidatat cupidatat cillum quis consequat. Est proident aute consequat minim eu aliquip sit nisi dolor reprehenderit ex et quis dolor. Magna exercitation occaecat exercitation cillum aliqua in Lorem non consectetur."
      },
      "minitwit": {
        "title": "Twitter klon, med automatiseret deployment og monitorering",
        "description": "Der er stort fokus på at lære at udvikle software, men på universitetet stilles der sjældent spørgsmål til, hvad der sker, når softwaren er ude hos brugerne: Hvordan vedligeholder man den? Hvordan skalerer man med flere brugere? Hvordan identificerer og retter man fejl med minimal nedetid? På DevOps-kurset fik vi mulighed for at deploye en Twitter-klon med et stigende antal simulerede brugere. Vores opgave var at holde servicen kørende og implementere nye features. Projektet gav mig indblik i, hvordan udviklingsprocessen ser ud, efter et system er taget i brug."
      },
      "portfolio": {
        "title": "Udvikler portfolio hjemmeside",
        "description": "Hjemmesiden her er skrevet i TypeScript med React og deployet gennem DigitalOcean ved hjælp af Docker. Der er opsat en CI/CD-pipeline, som kører hver gang, man pusher til main. Gennem mit deployment-script builder og pusher jeg mit Docker-image til Docker Hub, hvorefter jeg SSH’er ind på min Nginx-server og opdaterer mit Docker-image."
      },
      "mcts": {
        "title": "Monte Carlo Tree Search simulation i stokastiske miljøer",
        "description": "Projektet omhandlede at finde den bedste løsning i et højt kombinatorisk miljø med stokastiske elementer, som øgede kompleksiteten. Miljøet var kortspillet UNO med fire spillere. Projektet gik ud på at udvikle en simuleret game engine for UNO og implementere en række agenter, der kan interagere med game-statet. Projektet kombinerede teoretisk viden om algoritmer og machine learning med gode software engineering-principper. Det blev udviklet i .NET med C# med udgangspunkt i test-driven development ved brug af xUnit."
      },
      "strandbeest": {
        "title": "Bluetooth fjernstyret 3d-printed Strandbeest, med app til IOS",
        "description": "Et af de sjoveste projekter, jeg har lavet, er en 3D-printet strandbeest, som kan styres med en app på iOS. Selve robotten er programmeret i C, og appen er lavet i Swift. Appen kommunikerer med robotten via Bluetooth og sender kommandoer til Arduino-boardet, som styrer motorerne. Projektet var en super mulighed for at kombinere min interesse for både hardware og software."
      }
    },
    "contact": {
      "title": "Kontakt Mig",
      "description": "Jeg er altid åben for muligheder, så i er mere end velkommen til at kontakte mig på mail, eller via LinkedIn. Derudover kan i også finde mig på GitHub, hvor jeg har en del af mine projekter liggende."
    }
  }
}
